In [57]:
import pandas as pd

In [58]:
# Dict 로 데이터프레임 생성
data = {
      '종목코드' : ['003730','036360','005760']
    , '종목명' : ['3R','3SOFT','ACTS']
    , '현재가' : [1510, 1790,1185]
}
data

{'종목코드': ['003730', '036360', '005760'],
 '종목명': ['3R', '3SOFT', 'ACTS'],
 '현재가': [1510, 1790, 1185]}

In [59]:
df = pd.DataFrame(data)
df

     종목코드    종목명   현재가
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [60]:
df.values

array([['003730', '3R', 1510],
       ['036360', '3SOFT', 1790],
       ['005760', 'ACTS', 1185]], dtype=object)

In [61]:
df.columns

Index(['종목코드', '종목명', '현재가'], dtype='object')

In [62]:
data = [
    ['003730', '3R', 1510],
    ['036360', '3SOFT', 1790],
    ['005760', 'ACTS', 1185]
]

In [63]:
df = pd.DataFrame(data)
df

        0      1     2
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [64]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [65]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [66]:
df.values

array([['003730', '3R', 1510],
       ['036360', '3SOFT', 1790],
       ['005760', 'ACTS', 1185]], dtype=object)

In [67]:
df

        0      1     2
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [68]:
df.columns = ['종목코드','종목명','현재가']
df

     종목코드    종목명   현재가
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [69]:
df.columns

Index(['종목코드', '종목명', '현재가'], dtype='object')

In [70]:
# set_index('컬럼명') : 특정 컬럼을 인덱스로 보낸다. 
df = df.set_index('종목코드') # 복제 진행, 원본
df

          종목명   현재가
종목코드
003730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [71]:
df['현재가']

종목코드
003730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

In [72]:
df

          종목명   현재가
종목코드
003730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [73]:
# 종목코드	현재가
# df[['종목코드','현재가']]

In [74]:
type(df['현재가']), type(df[['현재가']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [75]:
import pandas as pd
data = [
      ['3R',1510, 7.36]
    , ['3SOFT', 1790, 1.65]
    , ['ACTS', 1185, 1.28]
]
data

[['3R', 1510, 7.36], ['3SOFT', 1790, 1.65], ['ACTS', 1185, 1.28]]

In [76]:
import pandas as pd
data = [
      ['3R',1510, 7.36]
    , ['3SOFT', 1790, 1.65]
    , ['ACTS', 1185, 1.28]
]
data

index = ['037730','036360','005760']
columns = ['종목명','현재가','등락률']

df = pd.DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [77]:
df.iloc[-1] # 행번호 접근

종목명    ACTS
현재가    1185
등락률    1.28
Name: 005760, dtype: object

In [78]:
df.loc['037730'] # 명 인덱스로 접근

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [79]:
# 슬라이싱 : 연속
df.iloc[0:2]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [80]:
# 팬시 : 불연속 
df.iloc[[0,1]]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [81]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [82]:
df = df.loc[['037730','036360']]
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [83]:
df['종목명']

037730       3R
036360    3SOFT
Name: 종목명, dtype: object

In [84]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [85]:
df1 = df[['종목명','현재가']]
df1

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790

In [86]:
df1.iloc[0]

종목명      3R
현재가    1510
Name: 037730, dtype: object

In [87]:
df2 = df.copy()
df2

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [88]:
df2.loc[['037730','036360'],['종목명','현재가']]

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790

In [89]:
df3 = df.copy()
df3

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [90]:
# 현재가 >= 1400
cond = df['현재가'] >= 1400
cond

037730    True
036360    True
Name: 현재가, dtype: bool

In [91]:
df3.loc[cond]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [92]:
cond = (df3['현재가'] >= 1400) & (df3['현재가'] < 1700)
cond

037730     True
036360    False
Name: 현재가, dtype: bool

In [93]:
df3.loc[cond]

       종목명   현재가   등락률
037730  3R  1510  7.36

In [94]:
df4 = df.copy()
df4

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [95]:
df4

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [96]:
index = ['005760', '036361','037730']
s = pd.Series(data=[1000,2000,3000], index=index)
df4['목표가'] = s
df4

          종목명   현재가   등락률     목표가
037730     3R  1510  7.36  3000.0
036360  3SOFT  1790  1.65     NaN

In [97]:
df4['목표가'] = 1600
df4

          종목명   현재가   등락률   목표가
037730     3R  1510  7.36  1600
036360  3SOFT  1790  1.65  1600

In [98]:
df4['괴리율'] = (df4['목표가'] - df4['현재가']) / df4['현재가']
df4

          종목명   현재가   등락률   목표가       괴리율
037730     3R  1510  7.36  1600  0.059603
036360  3SOFT  1790  1.65  1600 -0.106145

In [99]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [100]:
# 현재가 1500 큰 종목 행 조회
df1 = df.copy()
df1.loc[df1['현재가'] > 1500]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [101]:
# 현재가 > 1500 행 삭제
df1.drop(df1.loc[df1['현재가'] > 1500].index, axis=0)

Empty DataFrame
Columns: [종목명, 현재가, 등락률]
Index: []

In [102]:
df1

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [103]:
df1.index.name = '종목코드'
df1

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [104]:
df1.rename(columns={
      '현재가' : 'close'
    , '종목명' : 'corpnm'
}, inplace=True) # 원본에 반영
df1

       corpnm  close   등락률
종목코드
037730     3R   1510  7.36
036360  3SOFT   1790  1.65

In [105]:
df1[['등락률','corpnm','close']] # loc, iloc X => 컬럼 접근

         등락률 corpnm  close
종목코드
037730  7.36     3R   1510
036360  1.65  3SOFT   1790

In [106]:
data = [
      ['1,000','1,100','1,510']
    , ['1,410','1,420','1,790']
    , ['850','900','1,185']
]
columns = ['03/02','03/03','03/04']
df = pd.DataFrame(data=data, columns=columns)
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   03/02   3 non-null      object
 1   03/03   3 non-null      object
 2   03/04   3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [108]:
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [109]:
def remove_comma_to_int(x): # map 적용할 때 x는 단일값
    return int(x.replace(',', ''))

In [110]:
# x.replace(',','')
text = '1,&1@85'
text.replace(',', '') \
         .replace('&', '') \
         .replace('@', '') 

import re # 정규표현식 처리 모듈
re.sub('(,|&|@)','',text)

'1185'

In [111]:
' 1,   234 '.replace(' ','')

'1,234'

In [112]:
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [113]:
def remove_comma_to_int(x): # map 적용할 때 x는 단일값
    return int(x.replace(',', ''))

# df.map(remove_comma_to_int)
df1 = df.copy()

In [114]:
df1['03/02'] = df1['03/02'].map(remove_comma_to_int)
df1

   03/02  03/03  03/04
0   1000  1,100  1,510
1   1410  1,420  1,790
2    850    900  1,185

In [115]:
import pandas as pd
data = [
      ['3R',1510, 7.36]
    , ['3SOFT', 1790, 1.65]
    , ['ACTS', 1185, 1.28]
]
data

index = ['037730','036360','005760']
columns = ['종목명','현재가','등락률']

df = pd.DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [116]:
from pandas import DataFrame

data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = DataFrame(data=data)
df

        cd      nm   close
0  A060310      3S   2,920
1  A095570  AJ네트웍스   6,250
2  A006840   AK홀딩스  29,700
3  A054620  APS홀딩스  19,400

In [119]:
df['close'].str

In [121]:
import numpy as np
df['close']=df['close'].str.replace(',', '').astype(np.int64)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cd      4 non-null      object
 1   nm      4 non-null      object
 2   close   4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes